# SQL Part 3

## Import pandas and MySQLdb

In [1]:
from sqlalchemy import create_engine
import pandas as pd

## Create the connection to MySQL database

- Define the connection to mysql database (mysql://user:passod@host/databse). More detail: http://zetcode.com/db/sqlalchemy/

In [2]:
eng = create_engine("mysql://root:spr18@localhost/PHC7065")
con = eng.connect()

## Create some tables

In [7]:
sqlq = '''
        DROP TABLE IF EXISTS Subject;
        CREATE TABLE Subject(
        id INT NOT NULL AUTO_INCREMENT,
        name VARCHAR(20) NOT NULL,
        gender INT NOT NULL,
        age INT NOT NULL,
        race INT NOT NULL,
        county_id INT NOT NULL,
        state_id INT NOT NULL,
        PRIMARY KEY (id)
        );
'''

In [8]:
con.execute(sqlq)

In [11]:
sqlq = '''
        DROP TABLE IF EXISTS County;
        CREATE TABLE County(
        id INT NOT NULL,
        state_id INT NOT NULL,
        name VARCHAR(20) NOT NULL,
        income INT NOT NULL,
        PRIMARY KEY (id,state_id)
        );
'''

In [12]:
con.execute(sqlq)

In [15]:
sqlq = '''
        DROP TABLE IF EXISTS State;
        CREATE TABLE State(
        id INT NOT NULL AUTO_INCREMENT,
        name VARCHAR(20) NOT NULL,
        policy INT NOT NULL,
        start_date DATE,
        end_date VARCHAR(20),
        PRIMARY KEY (id)
        );
'''

In [16]:
con.execute(sqlq)

## Insert some data

In [17]:
sqlq = '''
        INSERT INTO Subject(name,gender,age,race,county_id,state_id)
        VALUES  ('John',1,5,1,1,1),
                ('Mary',0,7,2,2,1),
                ('Mike',1,6,3,1,2),
                ('Linda',0,5,1,2,2),
                ('Lucas',1,4,1,1,3),
                ('Aiden',1,10,4,2,3),
                ('Alice',0,3,2,3,5);
'''

In [18]:
con.execute(sqlq)

In [19]:
pd.read_sql(sql="SELECT * FROM Subject",con=con)

   id   name  gender  age  race  county_id  state_id
0   1   John       1    5     1          1         1
1   2   Mary       0    7     2          2         1
2   3   Mike       1    6     3          1         2
3   4  Linda       0    5     1          2         2
4   5  Lucas       1    4     1          1         3
5   6  Aiden       1   10     4          2         3
6   7  Alice       0    3     2          3         5

In [20]:
sqlq = '''
        INSERT INTO County(id,state_id,name,income)
        VALUES  (1,1,'Alachua',78987),
                (2,1,'Orange',87689),
                (3,1,'Marion',65908),
                (1,2,'Newton',56765),
                (2,2,'Burke',67890),
                (1,3,'Glenn',98678),
                (2,3,'Kings',87908);
'''

In [21]:
con.execute(sqlq)

In [22]:
pd.read_sql(sql="SELECT * FROM County",con=con)

   id  state_id     name  income
0   1         1  Alachua   78987
1   1         2   Newton   56765
2   1         3    Glenn   98678
3   2         1   Orange   87689
4   2         2    Burke   67890
5   2         3    Kings   87908
6   3         1   Marion   65908

In [23]:
sqlq = '''
        INSERT INTO State(name,policy,start_date,end_date)
        VALUES  ('Florida',1,'2002-11-23','12/23/2006'),
                ('Georgia',0,NULL,'12/25/2007'),
                ('California',1,'2004-12-23','11/03/2009'),
                ('Washington',1,'2003-11-20','08/23/2007');
'''

In [24]:
con.execute(sqlq)

In [25]:
pd.read_sql(sql="SELECT * FROM State",con=con)

   id        name  policy  start_date    end_date
0   1     Florida       1  2002-11-23  12/23/2006
1   2     Georgia       0        None  12/25/2007
2   3  California       1  2004-12-23  11/03/2009
3   4  Washington       1  2003-11-20  08/23/2007

## INNER JOIN

In [26]:
sqlq = '''
        SELECT Subject.name, State.name as state_name, State.policy
        FROM Subject
        INNER JOIN State ON Subject.state_id=State.id
        ;
'''
pd.read_sql(sql=sqlq,con=con)

    name  state_name  policy
0   John     Florida       1
1   Mary     Florida       1
2   Mike     Georgia       0
3  Linda     Georgia       0
4  Lucas  California       1
5  Aiden  California       1

## LEFT JOIN

In [27]:
sqlq = '''
        SELECT Subject.name, State.name as state_name, State.policy
        FROM Subject
        LEFT JOIN State ON Subject.state_id=State.id
        ;
'''
pd.read_sql(sql=sqlq,con=con)

    name  state_name  policy
0   John     Florida     1.0
1   Mary     Florida     1.0
2   Mike     Georgia     0.0
3  Linda     Georgia     0.0
4  Lucas  California     1.0
5  Aiden  California     1.0
6  Alice        None     NaN

## RIGHT JOIN

In [28]:
sqlq = '''
        SELECT Subject.name, State.name as state_name, State.policy
        FROM Subject
        RIGHT JOIN State ON Subject.state_id=State.id
        ;
'''
pd.read_sql(sql=sqlq,con=con)

    name  state_name  policy
0   John     Florida       1
1   Mary     Florida       1
2   Mike     Georgia       0
3  Linda     Georgia       0
4  Lucas  California       1
5  Aiden  California       1
6   None  Washington       1

## FULL JOIN

In [29]:
sqlq = '''
        SELECT Subject.name, State.name as state_name, State.policy
        FROM Subject
        LEFT JOIN State ON Subject.state_id=State.id
        UNION
        SELECT Subject.name, State.name as state_name, State.policy
        FROM Subject
        RIGHT JOIN State ON Subject.state_id=State.id
        ;
'''
pd.read_sql(sql=sqlq,con=con)

    name  state_name  policy
0   John     Florida     1.0
1   Mary     Florida     1.0
2   Mike     Georgia     0.0
3  Linda     Georgia     0.0
4  Lucas  California     1.0
5  Aiden  California     1.0
6  Alice        None     NaN
7   None  Washington     1.0

## CROSS JOIN

In [30]:
sqlq = '''
        SELECT Subject.name,State.name
        FROM Subject
        CROSS JOIN State 
        ;
'''
pd.read_sql(sql=sqlq,con=con)

     name        name
0    John     Florida
1    John     Georgia
2    John  California
3    John  Washington
4    Mary     Florida
5    Mary     Georgia
6    Mary  California
7    Mary  Washington
8    Mike     Florida
9    Mike     Georgia
10   Mike  California
11   Mike  Washington
12  Linda     Florida
13  Linda     Georgia
14  Linda  California
15  Linda  Washington
16  Lucas     Florida
17  Lucas     Georgia
18  Lucas  California
19  Lucas  Washington
20  Aiden     Florida
21  Aiden     Georgia
22  Aiden  California
23  Aiden  Washington
24  Alice     Florida
25  Alice     Georgia
26  Alice  California
27  Alice  Washington

## Theta JOIN

In [31]:
sqlq = '''
        SELECT Subject.name, State.name as state_name, State.policy,Subject.state_id,State.id
        FROM Subject
        JOIN State ON Subject.state_id>=State.id
        ;
'''
pd.read_sql(sql=sqlq,con=con)

     name  state_name  policy  state_id  id
0    John     Florida       1         1   1
1    Mary     Florida       1         1   1
2    Mike     Florida       1         2   1
3    Mike     Georgia       0         2   2
4   Linda     Florida       1         2   1
5   Linda     Georgia       0         2   2
6   Lucas     Florida       1         3   1
7   Lucas     Georgia       0         3   2
8   Lucas  California       1         3   3
9   Aiden     Florida       1         3   1
10  Aiden     Georgia       0         3   2
11  Aiden  California       1         3   3
12  Alice     Florida       1         5   1
13  Alice     Georgia       0         5   2
14  Alice  California       1         5   3
15  Alice  Washington       1         5   4

## Some Useful String Functions

In [32]:
sqlq = '''
        SELECT UPPER(LEFT(name,2)) as new_name,LENGTH(name) as length_name
        FROM State
        ;
'''
pd.read_sql(sql=sqlq,con=con)

  new_name  length_name
0       FL            7
1       GE            7
2       CA           10
3       WA           10

In [33]:
sqlq = '''
        SELECT TRIM(LEADING 'F' FROM name) as new_name
        FROM State
        ;
'''
pd.read_sql(sql=sqlq,con=con)

     new_name
0      lorida
1     Georgia
2  California
3  Washington

In [34]:
sqlq = '''
        SELECT State.name as name_State, County.name as name_County, CONCAT(County.name,' County, ',State.name) as name
        FROM State
        INNER JOIN County ON State.id=County.state_id
        ;
'''
pd.read_sql(sql=sqlq,con=con)

   name_State name_County                      name
0     Florida     Alachua   Alachua County, Florida
1     Georgia      Newton    Newton County, Georgia
2  California       Glenn  Glenn County, California
3     Florida      Orange    Orange County, Florida
4     Georgia       Burke     Burke County, Georgia
5  California       Kings  Kings County, California
6     Florida      Marion    Marion County, Florida

## Useful Function for Time

In [35]:
sqlq = '''
        SELECT end_date, STR_TO_DATE(end_date,'%%m/%%d/%%Y') AS cleaned_end_date
        FROM State
        ;
'''
pd.read_sql(sql=sqlq,con=con)

     end_date cleaned_end_date
0  12/23/2006       2006-12-23
1  12/25/2007       2007-12-25
2  11/03/2009       2009-11-03
3  08/23/2007       2007-08-23

In [36]:
sqlq = '''
        SELECT EXTRACT(MONTH FROM test.cleaned_end_date) AS end_month  
        FROM
        (SELECT end_date, STR_TO_DATE(end_date,'%%m/%%d/%%Y') AS cleaned_end_date
        FROM State) AS test
        ;
'''
pd.read_sql(sql=sqlq,con=con)

   end_month
0         12
1         12
2         11
3          8

## COALESCE

In [37]:
sqlq = '''
        SELECT *, COALESCE(start_date,'2001-01-01') as recode_start_date  
        FROM State
        ;
'''
pd.read_sql(sql=sqlq,con=con)

   id        name  policy  start_date    end_date recode_start_date
0   1     Florida       1  2002-11-23  12/23/2006        2002-11-23
1   2     Georgia       0        None  12/25/2007        2001-01-01
2   3  California       1  2004-12-23  11/03/2009        2004-12-23
3   4  Washington       1  2003-11-20  08/23/2007        2003-11-20

# NHIS Data

## Import the 2015 Family File and Household File (https://www.cdc.gov/nchs/nhis/nhis_2015_data_release.htm)

In [38]:
family = pd.read_csv('../WK3/dat/familyxx.csv')
household = pd.read_csv('../WK3/dat/househld.csv')

In [39]:
# check the data
family.head()

,FINT_Y_P,FINT_M_P,FMX,RECTYPE,SRVY_YR,HHX,FM_SIZE,FM_STRCP,FM_TYPE,FM_STRP,...,COVCONF,FHICOST,FMEDBILL,FMEDBPAY,FMEDBNOP,FSAF,FHICOVCT,FHICOVYN,FPRCOOH,FHIEBCCT
0,2015,1,1,60,2015,4,1,11,1,11,...,NaN,0,2,2,NaN,2,1,1,2.0,0.0
1,2015,3,1,60,2015,5,4,41,4,41,...,2.0,3,1,2,2.0,1,4,1,2.0,4.0
2,2015,2,1,60,2015,11,1,11,1,11,...,2.0,2,2,2,NaN,2,1,1,2.0,1.0
3,2015,1,1,60,2015,13,2,21,2,21,...,4.0,4,2,1,NaN,2,2,1,1.0,2.0
4,2015,3,1,60,2015,16,1,11,1,11,...,NaN,4,2,2,NaN,2,1,1,2.0,0.0

In [40]:
household.head()

,INTV_QRT,INTV_MON,LIVQRT,ACPTCHLD,REJ_PER,REJ_FAM,ACPT_PER,ACPT_FAM,NON_INTV,RECTYPE,SRVY_YR,HHX,REGION,WTIA_HH,WTFA_HH,STRAT_P,PSU_P
0,1,3,1,NaN,NaN,NaN,NaN,NaN,1.0,10,2015,1,2,3052.5,0,108,2
1,1,3,1,NaN,NaN,NaN,NaN,NaN,1.0,10,2015,2,1,2497.5,0,47,2
2,1,3,1,NaN,NaN,NaN,NaN,NaN,2.0,10,2015,3,1,1086.7,0,19,2
3,1,1,1,0.0,0.0,0.0,1.0,1.0,NaN,10,2015,4,3,3330.0,3330,163,2
4,1,3,1,2.0,0.0,0.0,4.0,1.0,NaN,10,2015,5,4,138.7,185,289,2

## Export the data to MySQL database

In [41]:
family.to_sql(name='Family',con=eng,if_exists='replace',chunksize=100)
household.to_sql(name='Household',con=eng,if_exists='replace',chunksize=100)

## Check the exported data

In [42]:
sqlq = '''
        SELECT *
        FROM Family
        LIMIT 5
        ;
'''
pd.read_sql(sql=sqlq,con=con)

,index,FINT_Y_P,FINT_M_P,FMX,RECTYPE,SRVY_YR,HHX,FM_SIZE,FM_STRCP,FM_TYPE,...,COVCONF,FHICOST,FMEDBILL,FMEDBPAY,FMEDBNOP,FSAF,FHICOVCT,FHICOVYN,FPRCOOH,FHIEBCCT
0,0,2015,1,1,60,2015,4,1,11,1,...,NaN,0,2,2,NaN,2,1,1,2.0,0.0
1,1,2015,3,1,60,2015,5,4,41,4,...,2.0,3,1,2,2.0,1,4,1,2.0,4.0
2,2,2015,2,1,60,2015,11,1,11,1,...,2.0,2,2,2,NaN,2,1,1,2.0,1.0
3,3,2015,1,1,60,2015,13,2,21,2,...,4.0,4,2,1,NaN,2,2,1,1.0,2.0
4,4,2015,3,1,60,2015,16,1,11,1,...,NaN,4,2,2,NaN,2,1,1,2.0,0.0

In [43]:
sqlq = '''
        SELECT *
        FROM Household
        LIMIT 5
        ;
'''
pd.read_sql(sql=sqlq,con=con)

,index,INTV_QRT,INTV_MON,LIVQRT,ACPTCHLD,REJ_PER,REJ_FAM,ACPT_PER,ACPT_FAM,NON_INTV,RECTYPE,SRVY_YR,HHX,REGION,WTIA_HH,WTFA_HH,STRAT_P,PSU_P
0,0,1,3,1,NaN,NaN,NaN,NaN,NaN,1.0,10,2015,1,2,3052.5,0,108,2
1,1,1,3,1,NaN,NaN,NaN,NaN,NaN,1.0,10,2015,2,1,2497.5,0,47,2
2,2,1,3,1,NaN,NaN,NaN,NaN,NaN,2.0,10,2015,3,1,1086.7,0,19,2
3,3,1,1,1,0.0,0.0,0.0,1.0,1.0,NaN,10,2015,4,3,3330.0,3330,163,2
4,4,1,3,1,2.0,0.0,0.0,4.0,1.0,NaN,10,2015,5,4,138.7,185,289,2

## Subqueries

In [44]:
# what's the maximum number of families within a household?
sqlq = '''
        DROP TABLE IF EXISTS Temp;
        CREATE TABLE Temp(
        SELECT COUNT(FMX) AS MAX_N_FAM
        FROM Family
        GROUP BY HHX
        )
        ;
'''
con.execute(sqlq)

In [45]:
sqlq = '''
        SELECT MAX(MAX_N_FAM) 
        FROM Temp
        ;
'''
pd.read_sql(sql=sqlq,con=con)

   MAX(MAX_N_FAM)
0               6

In [46]:
sqlq = '''
        SELECT MAX(temp.MAX_N_FAM)
        FROM
        (
        SELECT COUNT(FMX) AS MAX_N_FAM
        FROM Family
        GROUP BY HHX
        ) AS temp
        ;
'''
pd.read_sql(sql=sqlq,con=con)

   MAX(temp.MAX_N_FAM)
0                    6

In [47]:
# return 1) the highest education level (Family.FM_EDUC1) within a household and 2) the housing type (Household.LIVQRT) for each household

In [48]:
sqlq = '''
        DROP TABLE IF EXISTS Temp2;
        CREATE TABLE Temp2(
        SELECT HHX,FMX,
               CASE WHEN FM_EDUC1 BETWEEN 97 AND 99 THEN NULL
               ELSE FM_EDUC1
               END AS recodeFM_EDUC1
        FROM Family)
        ;
'''
con.execute(sqlq)

In [49]:
sqlq = '''
        DROP TABLE IF EXISTS Temp3;
        CREATE TABLE Temp3(
        SELECT MAX(recodeFM_EDUC1) AS MaxEDUC, HHX
        FROM Temp2
        GROUP BY Temp2.HHX)
        ;
'''
con.execute(sqlq)

In [50]:
sqlq = '''
        SELECT Temp3.HHX,Temp3.MaxEDUC,Household.LIVQRT
        FROM Temp3
        LEFT JOIN Household ON Temp3.HHX=Household.HHX
        LIMIT 10
        ;
'''
pd.read_sql(sql=sqlq,con=con)

   HHX  MaxEDUC  LIVQRT
0    4        6       1
1    5        8       1
2   11        9       1
3   13        4       1
4   16        8       1
5   19        7       1
6   21        2       1
7   23        8       1
8   24        5       5
9   25        2       1

In [51]:
sqlq = '''
        SELECT t2.HHX,t2.MaxEDUC,Household.LIVQRT
        FROM
        (SELECT MAX(t1.recodeFM_EDUC1) AS MaxEDUC, t1.HHX
        FROM
        (SELECT HHX,FMX,
               CASE WHEN FM_EDUC1 BETWEEN 97 AND 99 THEN NULL
               ELSE FM_EDUC1
               END AS recodeFM_EDUC1
        FROM Family) AS t1
        GROUP BY t1.HHX) AS t2
        LEFT JOIN Household ON t2.HHX=Household.HHX
        LIMIT 10
;
'''
pd.read_sql(sql=sqlq,con=con)

   HHX  MaxEDUC  LIVQRT
0    4        6       1
1    5        8       1
2   11        9       1
3   13        4       1
4   16        8       1
5   19        7       1
6   21        2       1
7   23        8       1
8   24        5       5
9   25        2       1